[{"text":"Hi Leah, I ordered this early to give to a co-worker for a Christmas gift. However, I am really impressed with they 3D item came out. I do plan to show it to another co-worker to see what she thinks about the outcome. Thank you reaching out and most of all it was such a quick turnaround.  \n  Great service.  Matthew Mason;\n\n Sent from Yahoo Mail on Android","sentiment":1},{"text":"Good evening, \n  I just received my order! I have to say- I was moved to tears. The details and clarity is just stunning! I got your company information from a client of mine, who received one of your pieces, and she was moved to tears as well. My piece is also a gift, and I cannot wait to give it to Him! Thank You so much!  \n  Cynthia Burns;\n\n\nSent from Yahoo Mail for iPhone","sentiment":1},{"text":"I couldn’t find where I could write a review but 5 stars all the way!  I ordered for my son’s birthday with a photo of his 2 rescue dogs.  It was shipped out and delivered so quickly and I know he will treasure it forever.  I would not hesitate recommending your business to friends and family.  Thank you for your fabulous work.   Marcus Cisneros  \n\n Sent from my iPad","sentiment":1},{"text":"I received my order today and gave it to my sister to remind her of her beautiful dog that passed away. She cried when she opened it and said she couldn’t believe how much it looked like her and the quality was exceptional. Thank you for the quick shipping and top notch customer service, I will be purchasing another one for my other sister and will be sure to give a rave review!!!    Sincerely,  Michelle Taylor \n\nSent from Yahoo Mail for iPhone","sentiment":1},{"text":"﻿Max,\n\nWe received the heart but sadly are disappointed that there are two scratches on the front face of the heart, the top one being the worst. I have attached pictures so you can see what I’m referring to. I’d like to get redone and want to know the process.\n\nThanks,\n\nAnthony Brown\n\n589-782-0054\n\nimage0.jpeg\n\nimage1.jpeg\n\nSent from my iPhone","sentiment":0},{"text":"Received my \nItem today, this is the second we have ordered from you... its perfect.","sentiment":1},{"text":"I am not satisfied with the quality of the items I order, the items itself had a very cloudy look and the picture isn’t as clear because of this, this is a father day gift to my husband who lost his mother last year and father says was always a big deals for her because of how proud she was of him and the father he is to our daughter, and his step kids. 70 dollar for a items of such poor quality is a disappointment. \n\n Sent from my iPhone","sentiment":0},{"text":"Hello , I bought this tower for my girlfriend but I am not happy with how it came out. The picture is very dull and cannot be seen and the picture does not appear on the other 2 dimensions of the cube. Also I feel scammed, I paid $45 for this and I expected so much more. Not only is it small, it is not of good quality. I would like a refund because I cannot except this.","sentiment":0},{"text":"Hello Corey.  \n\n I just wanted to tell you, we got our item today (June 18,2020). It's better than any of the pictures you sent. My mother was ecstatic. She loved it. I realized it's 364 days since that picture was taken. I couldn't have planned that if I tried. Thank you for your hard work. I appreciate all the questions you answered for me. Thank you so much.  \n\n Your NEW frequent customer, \n\n Bruce","sentiment":1},{"text":"The item looks great! Can't wait until Christmas to give it to my daughter. Thank you. \n\n \n\n \n\n Kurt Warren","sentiment":1},{"text":"Well I am very disappointed with this order that I paid a lot of money for. The photo in the larger item looks terrible and is short on both sides about 1\/2”. Meaning unlike my last order with the larger item this order the 3 item photos were not made available for enough and it looks terrible. I am not satisfied at all and now will not ever leave a good review. This is poor quality.","sentiment":0},{"text":"Recibe do the order,very disappointed,paid for the engraved didn't do,the rotated order one send 2, the side for the rotaiting ligth order M send S ,Almost paíd 150 dólares,no even a nice box ,looks so Cheap made in North Anita I will be retorned is a joke so mad  \n\n Sent from my iPad","sentiment":0},{"text":"Good Morning Tricia,\n\nI just wanted to thank you again for your gracious offer to replace our lost shipment. \n\nYour thoughtfulness is so appreciated \n\nCynthia Simmons.  \n\n Sent from my iPad \n\n ﻿","sentiment":1},{"text":"Hello, \n \nI justwanted to saythankyou for such a lovely piece. It turned out really well and I'm sure the person I'm sending to will be amazed. \n \nThanks, \n \nShawn Jones","sentiment":1},{"text":"Hi The item photo you made I am not happy with it. 1) The face in the engraving is different than the Original photo face. 2) The quality of engraving is so poor I can’t see the object Clear enough without light. 3) even with the lights I can’t see much object because engraving Quality was so poor.         4) if you want to try second time do it so.  Then if the quality comes out same like this,  I want to get my money back. 5). I called you the phone number listed on the website but you don’t answer. It’s very suspicious that you don’t take customers phone call . Why don’t you give me a call so I can explain how the quality has to be. My phone number is 625-836-9563 thank you \n\n Sent from my iPhone","sentiment":0},{"text":"I am in tears!! You all truly did an amazing job! I lost one of my brothers August of 2019 so I wanted to make this Christmas special for the other two brothers that I have left, by gifting them a memory they cherish. You all exceeded my expectations and I will definitely put in another order. Thank you so much! \n  Kathleen Chavez\n\n Sent from my iPhone","sentiment":1},{"text":"Susan, \n\n \n\n \n\n I received my item and it is beautiful!! I miss my girl Kristina so much,\n and the item displayed and lit up is a constant remembrance of her. Thank you \n\n for the great work. I was just thinking of sharing a picture of my new treasure on \n\n your Facebook page would this be ok? \n\n \n\n \n\n Thank You, \n\n \n\n\n \n Casey Warren\n\nderekkent@hotmail.com","sentiment":1},{"text":"My mother absolutely love it!!!!!! She was in tears ! Thank you so much","sentiment":1},{"text":"Hello, Received my item today and am disappointed you chose to orient the photo in the height of the block and sent the black base oriented to light the width of a block which will not work for lighting my item! Please help me to rectify this order soon as it is a special occasion gift. Thank you  Tammy Bullock  Order 877-859-826171  Phone 2388875363","sentiment":0},{"text":"Thank both Recieved and are perfect !! Patty\n\n Sent from my iPhone","sentiment":1},{"text":"I received the Item a few days ago. I was verypleasantly surprised how beautiful the item was. The detail was excellent and the photo looked 3d. I received so many compliments on it. I did make a  huge mistake on it. I put a date of 1974 when it should have been 1973. I can't believe I did that. It was  totally my fault. That takes away something from it for me. There's nothing I can do about it now.  \n  Thank You for everything your and yourteam did. You do excellent work and it's a memory that will last  a lifetime! I will let everyone who I show it to see how your company is the best. Thanks again, Tammy Logan;","sentiment":1},{"text":"To whom it may concerned, \n  Hi I purchased a item a while back and I just am very disappointed on the outcome.  \n  First of all, the shipment was over the due date which you guys promised, second this item came with no light base which I'm seeing my receipt and it said I clicked on \"no base\" which must be a malfunction because what's the point of getting a 120$ item with no lights. FINALLY, what is this? Why are you charging so much for something that fits in my pocket?  \n  Listen I get we are in a crisis but please don't screw your employees. These are memories to cherish not something to play hide and seek with.  \n  Thank you.","sentiment":0},{"text":"Product was delivered this was supposed to be a anniversary present. The quality of this product is nothing like it looked on the website. \n The quality is horrible and you can barley see the picture. To say the least I am very disappointed. \n  \n Thank You. \n Derrick Davis. \n ","sentiment":0},{"text":"I received the wrong item and I’m not to happy about this. I wanted my daughter to have this before Xmas. I’m sure the lady who’s item I got is not happy either. You need to make this right. And get me this before Friday. I ordered this 2 weeks ago","sentiment":0},{"text":"Hey Max; \n  Arrived this morning. They are beautiful and very well done... much sharper and crisper than Iexpected, and I was expecting good quality.  \n  Thank you very much... this will mean so much to my girlfriend who lost her parents two years ago within one month of each other.  \n  Great work.","sentiment":1},{"text":"First and foremost, I absolutely LOVE my purchase and I'm sure my wife will as well! Arriving just in time for our one year anniversary I cannot thank you enough, timing, quality and customer service all great! I will definitely be visiting in the nearfuture, thank you again!","sentiment":1},{"text":"I am happy crying because it is so beautiful! Thank you so much. I will recommend you to everyone! It is amazing and exactly what I pictured for my grandma! Thank you thank you! \n\n Sent from Yahoo Mail for iPhone","sentiment":1},{"text":"Hello, I received my Item today and I just want to say it looks better than I could of ever imagined. Thank you so much.  \n\n If you can send me a link I would be more than happy to leave a review.  \n\n Brandon  \n\n >","sentiment":1},{"text":"Thank you so much Spencer. He loves it","sentiment":1},{"text":"Kelly,  \n  Both packages came in before Christmas and look great as usual. Thank you for rushing on the second one. Merry Christmas!  \n  Joe Martinez \n  West Lindseyberg, CO","sentiment":1},{"text":"I love how it came out, thank you so much!! \n  \n MEAGHAN PURNAVEL\n\nAdvantage Title\n\nshaffererica@gmail.com\n\n\n\n\n\n\n\n201 Old Country Road, Suite 200, Lake Brianmouth, MH 11747\n\n(213)540-5328 |\n\nadvantagetitle.com\n\nLake Brianmouth | Garciabury\n| East Kellyberg\n| Unit 7600 Box 2698\nDPO AP 04372\n\n\nALTA Best Practices Certified","sentiment":1},{"text":"I didn’t want my picture separated! This is not what I ordered.. This was supposed to be a gift for my mother in law’s 70th birthday as a tribute to her husband who is dead. I am so beyond upset & disappointed in what I received because it split their family apart! \n  This is what I received:     \n This is what I submitted:    \n \n  -- \n Brenda Fields | Cameron Warner\n(205) 495-3431 | (662) 801-3097","sentiment":0},{"text":"Hello, I am unable to leave a review to due to not having an account. However , I just wanted to let you all know that I LOVED this item . It was better than I imagined . It brought my grandmother to tears. Thank you so much for your wonderful work and swift delivery! I will definitely be referring you guys to other people and ordering again!  \n\n Amber Rogers","sentiment":1},{"text":"Hi Sarah, I e-mailed you about a item I ordered and was disappointed with. The back feet looked like testicles, although this was a female dog. I felt uncomfortable giving this to my best friend. You immediately corrected the problem and sent me the new replacement item of her dog. I love it and so will she. I just wanted to thank you for excellent customer service. I will be ordering again and recommend your site and product to others, along with positive reviews on your site. Thank you very much. Wesley Harrington  \n\n Sent from my iPhone","sentiment":0},{"text":"Just received it Love it it's beautiful thanks\n\n Sent from Yahoo Mail on Android","sentiment":1},{"text":"I’m so disappointed in how small this is . At this price point the pic was very deceiving. I’m not happy this is for my mom for my sister who just passed .","sentiment":0},{"text":"Morning Ellen, \n \n\n \n Yesterday, June 18th, was our 15 year anniversary, and my husband finally opened his gift wrapped cube. He liked the present, but I do have to share with you that I am a little disappointed about the way it turned out. This has\n to do with how the preview looked like and the reality in regards to his head in the cube looks like it does not fit properly in the cube\/ there is not enough space left on top. I am attaching pics of preview and reality. Otherwise, I like it. \n \n Thanks\n Justin \n \n \n\n \n Get Outlook for iOS","sentiment":0},{"text":"Thank you for sending my item Emily. However am disappointed that it’s not in color. The picture appears in grey! That’s not the kind of memory I was looking for.   Is it possible to have it in color?And then is it possible to send it in any other color other than black. Please find something that’s not in a form of a casket. A regular padded box would be nice.    Otherwise if the order cannot be altered then am afraid I would like a refund because I will have no use for itthen. Am so sorry i did not know thatI was supposed to request these specifics in detail. I assumed the picture would appear in color as it is. Thank you for considering my request.  \n  Sincerely  Nancy SnyderSent from Yahoo Mail for iPhone","sentiment":0},{"text":"Review, I will definitely leave a review. I am totally pleased with the product and just ordered two more. It is beautiful!! Thank you.","sentiment":1},{"text":"My item is great however I ordered 2 and one does not have the engraving on it and I'm super disappointed in the 2nd one but the one that's correct is amazing","sentiment":0},{"text":"This your company photo is absolutely beautiful great job thank you Andrew\n\nSent from my iPhone","sentiment":1},{"text":"I just received my purchase and it is better than I could have expected. Thank you all so much for what you do and did for me. \n \n \n\n \nGet Outlook for Android","sentiment":1},{"text":"So sorry, I just answered the wrong e-mail. I did receive it. \n\n I absolutely love it!!! It is So beautiful, I am going to tell everyone I know how wonderful this company is. This is a gift for a very special\n\nanniversary and I know they will love it. \n\n Thank You\n\nAlexis","sentiment":1},{"text":"My order arrived today in perfect condition and it is absolutely beautiful!!!! Thisis going to bemy daughter’s Christmas present from her sons(pictured) and she is going to love it!! \n  Thank you,  Miguel Jackson\n\n\n  Sent from AOL Mobile Mail\nGet the new AOL app: mail.mobile.aol.com","sentiment":1},{"text":"Order #658-205-051953 I just received it today . I just wanted to tell you how much I love the two units you made for in remembering my wife that we lost sept 2020. These are Christmas gifts for a friend and my son and daughter-in-law. I had previously order the small units but they are to small. The large ones are excellent and I am sure the kids and friends will love them. Now I will have to be ordering one for me,\n\nThank You","sentiment":1},{"text":"I received my Item on 11\/19\/2022.  It cost me $139.00 and I am not impressed. The photo is a picture of me and my sister.  Parts of the picture appear to be exposed twice.  It looks like I have 4 eyes and my sister has two sets of upper teeth. Even the print is exposed twice. The words “always” and “my” have a shadow behind the word. I’m not impressed.   Ideally I would like a new one that looks acceptable and like the picture. If this is not possible I would like a refund. \nThanks.","sentiment":0},{"text":"We are very disappointed with the image quality of our most recent order (#848235987589). The image of our kitty (Jessica) is pale and flat, and the tip of his back ear is clipped. Ironically, we expressly contacted your company with this concern prior to ordering and were assured a team member would carefully adjust the image and cropping! Our previous order (of our cat Karen) was perfect: luminous, dimensional, fully rendered & well cropped. It was based on this result that we placed this order. We would like your company to correct and replace this item with a similar quality image. Our desire is to focus more on Jessica’s head and ears than his legs. If there isn’t space to do that in the item without reducing image size, we can re-crop the image and send it to your company. The depth and luminosity of the image also needs to be enhanced. Please contact us.","sentiment":0},{"text":"Hello, we did love the item, I actually need to order another one. For some reason I can not get into the website to login. Can you place another order for me? Thank you\n \n  \n  \n Marvin Lyons -\n  \n Sent from \nMail for Windows 10 \n ","sentiment":1},{"text":"Good morning Darlene, \n  I just wanted to thank you so very much for making my friend and her boyfriend the item I ordered with their pic! It just came in the mail today (thanks for the email update) and I opened it before I gift it to them and it looks absolutely stunning, especially with the light! I love it so much!!! It's such a wonderful gift, I'm sure they're going to love it too! Thank you so much! I'll definitely be ordering one of these for my boyfriend as well! Would be very happy to leavea great review!  \n  Thanks again,  \n  Christie   \n -- \n     Benjamin Martin;  Ph.D. Candidate in Chemistry  University of Pittsburgh\n Cellphone:316-784-4128  Email:alicia96@yahoo.com","sentiment":1},{"text":"I sent the following message last week. Thank you. \n  \n \n\n\n\n\n  \n\n\n Brittany\n \n \nDec 14, 2020, 11:43 AM EST\n \n \nI LOVE\n❤️ LOVE\n❤️ LOVE\n❤️ IT!!!!! Thank you so much. I will be passing examples of your work\n on to friends and family.\n\nHave a very merry Christmas and a happy and prosperous new year.\n\nBrittany \n \nSent from my iPad \n\n\n\n\n \n  \n  \n Sent from \nMail for Windows 10 \n ","sentiment":1},{"text":"Hello,I received my order today. thank-you!! my Daughter will love it!! I'm giving for Christmas gift. thank you again!  I will recommend to friends!!","sentiment":1},{"text":"You have received a message. \n\n Message: \n\n Hello I just received my package of a engraved tower item with base and when I opened it, it did not have the image that was supposed to be engraved on it or the text that was supposed to be on it. So I'm contacting you for a refund or the item that I originally ordered. Hope we can get this settled quickly and hope your having a nice day.","sentiment":0},{"text":"I’m so impressed with your work! I just wish I had ordered a larger size. So I’m going order a larger size. \n\n Thanks so very much\n\nTina\n\nSent from my iPhone","sentiment":1},{"text":"I am not happy!  I paid for expedited shipping to arrive today for a gift, (Tuesday November 22nd), when I checked the tracking number you provided it says the order was canceled with UPS.  Your last email to me said it was in its way????  I didn't get notification from you that it was canceled, what is the deal!!!?","sentiment":0},{"text":"I am not satisfied with the Item I selected.  It is way too small and blurred on the side.  Please contact me with other options.  Thanks you.","sentiment":0},{"text":"Kelly, \n My friend received his item late last week and was speechless! I opened it before mailing it to him and marveled at this exquisite creation! I'm expecting mysecond shipment of four items later today.  \n  I have attempted to submit my 5-star review twice, but it has not shown up on the review page yet. Today's review was a little more in depth and will resubmit with three pics. Please provide some assistance.  \n  Thanks...Alejandro Delgado","sentiment":1},{"text":"I was hoping that the picture would be adjusted and the product done but when I saw the product, it was cropped incorrectly. I am not satisfied with the product","sentiment":0},{"text":"Support, \n\n I was very disappointed in the contrast of my purchase. \n\n I am not sure what can be done to improve this. \n\n Michael Diaz","sentiment":0},{"text":"I am not satisfied with the item i got recently the picture seems to be unclear, so I would like to return it. Could someone please help me with the return and refund me the amount back.\n\nThanks,\nSteve","sentiment":0},{"text":"Hi, I received my order and I absolutely love it. I ordered a large and I just wanted to make sure that's what I received. Can you confirm that this is a large and nota medium? \n  Thank you!","sentiment":1},{"text":"I am very very very disappointed and pissed of‼️‼️with your incompetence- sending my package to the wrong address  \n\n Sent from my iPhone","sentiment":0},{"text":"Hello, \n\n I have sent numerous emails on my item that I am not satisfied with the purchase.  I feel the purchase does not come come to a $169 gift.  A negotiated settlement is what I am looking for.  Thank you for reading my email. \n\n Sent from my iPhone","sentiment":0},{"text":"Hi Vincent,\n\nThe item is beautiful! And my friend loves it! Thank you for an awesome transaction. \n\nTake care \n\nVictoria \n\n ﻿","sentiment":1},{"text":"Thank youfor your email I can't wait for my fiance to open it I was a little shocked how small it way but it's still perfect happy holidays I will definitely be ordering again soon","sentiment":1},{"text":"Thank youvery much for making our item for us. You did an amazing job and love how it turned out. Thanksagain!!","sentiment":1},{"text":"The orders I've made are for Christmas. The girls are with our dad who passed in 2017. With this pandemic going on I won't know their reactions personally. When I got the first order of my parents I cried because it was so beautiful. I thank you so much for\n your company's work. \n \n \n\n \nGet Outlook for Android","sentiment":1},{"text":"I’m looking forward to the email where I can rate your product. The timeless item blew away our expectations. My dad lost his wife and I was looking for a way to celebrate her memory this Christmas. He cried when he opened the box and saw her beautiful likeness encased in the item. When he placed the piece on the lit stand it was absolutely gorgeous. You guys knocked it out of the park.  \n  He has sent me several texts since Christmas Day to tell me how much he loves the gift. This is a man of very few words and even fewer texts.  \n  -“She is now resting on (his) nightstand and watching over (him).  \n  Thank you!  \n  P.S. I’ll need to order another kit stand b\/c he wants to keep it on permanently and I’m not sure how long the lights are meant to last.  \n  \n    ---------- Forwarded message ---------","sentiment":1},{"text":"\n Message \n Today was my 12th anniversary and my wife opened her wrapped gift. I had the opportunity to see it for the first time. She was impressed but I was disappointed in the fact that the lettering \" I love you\" was crooked\/ on a slant. At $ 143 for the piece that mistake was disappointing.","sentiment":0},{"text":"Thank you but I was saying I thought the Item itself was going to be bigger since it was a large. It’s beautiful in every kind of way! I thank you all!\n\n  I’m sending this again because maybe you didn’t receive it the first time.\n\n Sent from my iPhone","sentiment":1},{"text":"Mr. Lans, \n  Thank you for this email and the opportunity to let you know about the finished product that I received yesterday. My husband Christopher, helped me order this item gift for a good friend who lost her daughter Kimberly. I’ve ordered these 3D products before with wonderful results, but I’m wondering now if maybe it was from a different company because I must tell you I was VERY disappointed with the end result of this one. It’s very hard to see exactly what the finished product is going to look like on a computer screen, so thought choosing the heart design would work. But it didn’t at all. The bottom of the heart looks like it’s making a “dent” in the top of Kimberly’s head. So there is no way I could possibility send this to my friend. I think your system should be able to advise you if the image submitted would not be a good fit and allow you to either choose a different item or perhaps suggest you selected a larger size heart. If given the choice, (for only $20 more) I could have chosen the large item “brick” which would have looked much better. I was also surprised at how small the “medium” heart was and the $60 jump in cost for the large size.   \n  So with all this being said, I’d like to know what my options are and if it’s possible to return this item for a full refund OR perhaps a reorder of something else.   \n  Thanks for your help.  \n  Pamela Peterson;  \n  \n\n Sent from my iPad  \nBegin forwarded message:","sentiment":0},{"text":"I ordered 5 key chains, I am not happy with.you can’t see the pictures in them .I want to return them.","sentiment":0},{"text":"My husband absolutely loves it! I was so excited to give it to him, that I couldn’t wait till Christmas! Beautiful! I will be ordering more from you. Thank you! \n\n Sent from my iPhone","sentiment":1},{"text":"The order has arrived and it is beautiful...... My granddaughter will be giving it to her parents on Christmas day! I'm sure they will love the gift! \n  You have gone beyond great customer service. It is finally appreciated that some companies like yours still exist in the world.  \n  Thank you for everything.  Merry Christmas and a Happy New Year!  \n  Regards,  \n  William Reynolds","sentiment":1},{"text":"\n Message \n I bought this item for my wife. The images online show the item with pictures so clearly. Our picture barely shows. It looks like just. A big glass piece. Also the item shows it with the base and even shows the base separate. However I did not receive a base. So I spent $100 on a piece of glass no base with photo barely noticeable? I am not satisfied with this and I know she won’t be.","sentiment":0},{"text":"The items I purchased were beautiful!! I ordered two and both were from pictures of pets we have lost. It is an amazing keepsake to help them remain in our hearts❤️ Thank you!!! \n\n Sent from my iPhone","sentiment":1},{"text":"Hello Leroy, \n\n I received my order on Friday and gave it to my parents. I just felt the need to reach out to you and thank you for your help with the order, the item was exceptional and far passed my expectations of what it was going to look like. Rest assured that when we have a need for another one there is no one I would rather have do it for me and I will promote yourproduct. The product speaks for itself but the Customer Service just adds to the phenomenal experience I've had. It was an emotional gift and it wouldn't have happened without you. Thank you again from a very appreciative and future customer.","sentiment":1},{"text":"Alan...the gift was for my wife...and she loved it !!! Thanks so much for your help with the photo. Great job! Armand.","sentiment":1},{"text":"Hello Kyle.  \n  I got my order and I am so very disappointed. It is not what I ordered ! it supposed to be in a brick shape, not a tower!!  \n  Below is the order description  \n   Birthday Brick Item, 3D Engraved  Photo  0177A3AA-5CE6-466F-8(349)460-04164ACC64C8.png  Engrave Text  على قَدْرِ طُهْر القلبِ تأني المواجع …. و تَجري على قَد ...   What I received is nothing to do with the shape I want !!  \n  Please let me know how you can help me fix this problem??  \n   Thank you  \n    Huda","sentiment":0},{"text":"Loved it- ordered more!\n\n Sent from my iPhone","sentiment":1},{"text":"I received the item and wanted to tell you how beautiful it is. I would have left a review but the email sent from y’all for me to leave a review appeared to be compromised. But you do some fantastic work. Thank you again!  \n\n Thank you and same to you","sentiment":1},{"text":"I was hesitant about the pricing but I took a chance and did business with you. Its safe to say I am pleased with your work. You engraved the saying I wanted in there \"when we have eachother, we have everything\" even tho I exceeded the limit you still made it happen for me. Im very pleased cause this is a gift for my better half and her family. I'll gladly give you a good review. Thank you for making a beautiful piece, looking forward to doing business withyou in the future","sentiment":1},{"text":"Hi William,    I did receive the new one and I love it. Thanks again for your quick and courteous response.    I also posted a 5 star review. THANK YOU!  ","sentiment":1},{"text":"Awww thank you all for the delivery updates. I’ll be looking out for the review email. Thank you all so much and EXCELLENT customer service! Stay safe and healthy:-)    Best Regards,  Christopher JenkinsSent from Yahoo Mail for iPhone","sentiment":1},{"text":"You do great work! Where can I tell the world?","sentiment":1},{"text":"Yes recieved it. It is wonderful. Thank you  \n  \n  \n   Sent via the Samsung Galaxy S7, an AT&T 4G LTE smartphone   \n  \n   -------- Original message --------","sentiment":1},{"text":"I received my replacement item and smaller base with no problems. Thank you!","sentiment":1},{"text":"Have purchased from you recently and was nothing but amazed. Love what I received from you guys. Im asking to touch base with you guys for another several purchases but the item I am trying to have done isn't showing up very well in live preview.  Can I speak with someone about working on the item.  I will try to attach picture. It is a single tree . The top shows up great but can't get trunk to show up. Please contact me so I can order more products.  Looking to order 3 of these tree pics.","sentiment":1},{"text":"Sent from my iPhone\n\nI have a big problem with my order.  First let’s me say the quality is Awesome, but I ordered Medium and received small.  I am willing to ship these back to show proof that these are smalls and not medium.  I’m very disappointed because these were gifts of a son who just recently passed away.  I ordered one previously in December so I KNOW FOR SURE THE OTHER 3 are SMALL not MEDIUM","sentiment":0},{"text":"Hello,  \n  I would like to start by saying I'm really excited for my 3D Item, which is a gift for a close friend, that I just ordered. I write this email to request some help with my order. Firstly, I wanted to ask , if possible, that no receipts or invoices be included in the packaging as my order is going to be shipped directly to the recipient of the gift and I would prefer them not knowing any amounts. Secondly, I understand that times are challenging right now and you guys are probably very busy but again, if possible, the order be prioritized in any way so that it is delivered closer to November 30th, 2020 as this is the birthday of the recipient and it would be awesome if they received their present on or around their birthday.  \n  I acknowledge my requests maybe be unusual but whatever you guys can do, would mean a lot to me!  \n  Thank you,  Ricardo Meyer","sentiment":1},{"text":"I received my ordered and it is AWESOME!!!!!!!!!!!! \n  \n I got this for my daughter. \n  \n The dog in the picture ( Maria) has been her best friend for almost 14 years. \n  \n Maria’s is not doing well so my daughter will need to make a very heart breaking discuss soon.\n \n  \n This will be such a awesome way to remember this very sweet dog. \n  \n Thank you for doing such a great job. \n  \n David Johnson \/Controller \n Tri Star Digital Connections, LLC \n 933-863-8945 \n ","sentiment":1},{"text":"Hi there!\n\nJust wanted to let you know we did in fact receive your product on time and in beautiful condition.  It is amaaazingly beautifully well done. Thank you so much.\n\nBest Regards,\n\nMichaela & Erik Velasquez","sentiment":1},{"text":"I have received my gift for my wife… and the rotating light base that I paid for is not in the box?? Please contact me asap.. I spent 144.00 on this item and I’m very disappointed at this point.. this picture is of our baby who we lost this year","sentiment":0},{"text":"Emily, I just want to say that i took your word for it & ordered the item even though i couldn’t preview it correctly due to the dark colors & oh my goodness it turned out sooooo perfect! I don’t know how you guys do it, but the money i spent was absolutely worth it. My boyfriend loved it & i couldn’t be anymore happier then what i already am with the way it turned out. Shipping was so fast even with COVID going on. I am so happy & thank you soooo soooo much for being so helpful & reassuring me that i would in fact get it in time & that you guys would make sure the picture showed up. Again thanks a million. I will definitely be recommending this to others! Hope you have an AMAZING day. \n  Thanks again,  Michael\n\n Sent from my iPhone","sentiment":1},{"text":"Yes I received my order. I expected it to be bigger. I'm disappointed in it, but will live and learn from this. There are so many that prey on people's feelings. M pricer.","sentiment":0},{"text":"Ordered the small item and I have seen these before but they were on a base with a light. What I received was just a block of item, if course it had the picture I chose in it but for $ 69.00 base price plus shipping tax was $ 85.00 for that price I was extremely disappointed that was not on a base with light. Can someone explain what I missed in the site I ordered from..","sentiment":0},{"text":"\n\n Message \n I just received my order and after eagerly waiting for my item, I am extremely disappointed because I have NO IDEA WHO THESE PEOPLE ARE!!!! That is not a memory of my deceased loved one! How can you have made such a horrible mistake! I am heart broken! How will you rectify this?","sentiment":0},{"text":"Alexandria Foster. I received the heart I ordered Last Friday October 30, 2020.  I LOVE IT, FANTASTIC.  I know my girlfriend will love it as well..  I cannot post a good review on Facebook atthis time. Afraid she might see a comment. But after Christmas I will definitely leave a good, excellent review.  And I will be a continued customer.  THANK YOU","sentiment":1},{"text":"I know this e-mail address is for support stuff but I just wanted to reach out and say how amazing my order turned out! The picture I used was of my brother who passed away in September and I ordered this for my mom. It is incredible and she is going to love it (and cry a lot.) Thank you so much for this wonderful gift, I can't wait to place my next order for a larger size! \n  Thank you again,  \n  \n  James Simmons","sentiment":1},{"text":"The lights in the stand do NOT work and not satisfied with the product at all for what I paid for it.  \nI need to Return and get a Refund...","sentiment":0},{"text":"I am disappointed in my item.The item is vertical instead of horizontal.","sentiment":0},{"text":"Sent from AT&T Yahoo I am very disappointed in my item. I had no idea it would be so small. I asked for the lighted model whic I did not receive. Any chance you can redo my orderMail for iPhone","sentiment":0},{"text":"I just received the product yesterday and it was amazing. I appreciate everything, and will leave a very good review once I get the email, I just wanted to let you know that it was amazing and will definitely recommend people to you!!","sentiment":1},{"text":"Yes my keychain arrived but was disappointed as the light up feature did not work.  The etching is nice but it would be easier to see if the light worked.  I don.t think it was the batteries but rather the light assembly.","sentiment":0},{"text":"Sirs,    I am somewhat disappointed in how this item turned out. I am attaching the original picture I submitted and a picture of the finished item. While the dog’s head and forelimbs are nicely rendered, the back is obliterated by a rectangle that looks like the grass he was sitting on but everyone who sees this asks what that rectangle is doing there. Would you please consider redoing this item isolating the dog and the frisbee from the rectangle of grass?   Thank you.","sentiment":0},{"text":"Thanks David for sending replacement with background. I am still not convinced with the quality of the item as it looks like different person on the side view. May be due to the picture chosen 3D did not come accurately. \n\n Sent from my iPhone \n\n ﻿","sentiment":0},{"text":"﻿Hello,\n\nI opened up my order and immediately noticed that part of the corner had chipped off. I also looked and was not happy with the way the engraving turned out. I got a picture of my dog and the bottom part of his beard is missing and not shown clearly in the picture, which is not how it looked in the preview. \n\nI am not satisfied with the product I have received as it came damaged and does not reflect the picture I wanted to portray. \n\nPlease let me know how your company can resolve this issue. \n\nRegards,\n\nRebecca Walker\n\nimage1.jpeg\n\nimage2.jpeg\n\nSent from my iPhone","sentiment":0},{"text":"Hi Bruce: \n  Thank you for remaking the item for me (and for Christopher) ... I really appreciate it! Sorry it was such a horrible picture to work from. Again, there were only a couple of photos to choose from and that was the better of the two. But thank you, thank you, thank you for going above and beyond and “tweaking it” even though my widow’s peak (and how it appeared in the picture that I provided to you) was none of Your Company Memories’ fault.  \n  I’m looking forward to receiving on Wednesday and also to giving it to Christopher for Christmas! I will definitely leave a wonderful review upon receipt! Thank you for the quick turnaround and shipping and fantastic customer service!\n\n Thanks again,  Stacie Henderson 3239 Redwood Road  588 Courtney Lodge\nTylerberg, WA 50039, Codyfurt  44(364)657-7325  josesmall@gmail.com   926-636-0224","sentiment":1},{"text":"Thank you! It is beautiful!","sentiment":1},{"text":"Hello people and staff of Your Company memories, \n  I just wanted to let you know I got my Item in and it’s beautiful. I absolutely love it and will definitely buy from you again in the future!  \n  Thanks so much  - Trevor Harrison;","sentiment":1},{"text":"I ordered three items for Christmas for my adult children.  It was of their grandmother that they loved so dearly and who they miss so much since her passing.  \n\nThe items were BEAUTIFUL and created happy tears on Christmas Morning.  Thank you SO MUCH for doing such a beautiful job and in such a timely manner.   We are so grateful for your help. \n\n Jasmine Kline \n\n Sent from my iPad","sentiment":1},{"text":"I just would like to thank you from the bottom of my heart it came out beautiful it really looks like my dad now I can see and be with him everyday thank you very much I will recommend to all my friends and family again thank you\n\n\n  Sent from AOL Mobile Mail\nGet the new AOL app: mail.mobile.aol.com","sentiment":1},{"text":"\n Message \n Order #245371902556 recibed, supposed to be engraved I paid for that didn't do,they send me 2 rotating light base only ask for one and they send me two,the side ask was M they send me S ,so disappointed how to send they back","sentiment":0},{"text":"Thank you for such good service. I received the replacement today.","sentiment":1},{"text":"Yes! It's perfect!\n \n\n \n Get \nOutlook for Android","sentiment":1},{"text":"Noah, \n I ordered a beautiful item piece last month (#(704)215-567313) and will be sending it to a friend soon. What a thing of beauty! I will need FOUR more itemsto accommodate 2 to 3 people each. I am in the process of selecting pics now. They will be smaller than the 5 setting I ordered earlier.   \n  Would I be eligible for some sort of discount with that volume purchase...coupon discount code maybe? Also, could you send them as a gift and include a short personal note? Each will be going separately to ND locations.  \n  Please provide any pertinent info to me.  \n  Thanks so much...Natalie Thompson  wayne92@yahoo.com","sentiment":1},{"text":"My order number 717-341-853214 has been shipped to the wrong address, you guys has it going to 743 Carey Center\nWest Matthewfort, GU 29889 and that’s not the address i provided. The address suppose to be 111 2nd street, South Carrie MS 39341. I received and email stating that it’s going to be shipped today and it’s going to the wrong address, very very disappointed! It has my deceased daughter and granddaughter pictures on it and now it’s lost or going to the wrong person.","sentiment":0},{"text":"I ordered from your company and  am extremely grateful for the beautiful work you did it was for my sister who just recently lost her son. It came out more beautiful than expected I wanted to leave a review but didn’t know how to sincerely Ronald Parker  \n\n Sent from my iPhone","sentiment":1},{"text":"I will definitely give a review and pic after Christmas. I almost cried when I saw it and I know my mom will be in tears. I can’t wait for her to open it up!\n\n Sent from my iPhone","sentiment":1},{"text":"I ordered 2 and they are not the same I ordered them to say Vincent Smith on both and only one had the name engraved on them and look nothing alike they are for my 2 children and our fur baby has passed and I was looking for a perfect gift for Christmas and the one is amazing just not happy with my second one the one that's correct is amazing","sentiment":0},{"text":"I got it in the mail today. I love it! I think this will spike sales for sure. When I get a booking I’ll let you know so you can tell me what to do next. \n\nThanks again.","sentiment":1},{"text":"Well thank you...I loved your customer service so much I have already placed another order for my husband. The picture is a little fuzzy I hope you guys can work with it. \n  Thank you so much in advance.  \n  We both have lost our parents...I lost my mom in November , his will be gone coming 10 years next April , and I just lost my father in July.  \n  These are so beautiful I have referred you to all our family and friends.   Jamie Roman","sentiment":1},{"text":"I just received my item and it is absolutely MF Amazing!!!!!! WOW.    \n\n Sent from my iPhone","sentiment":1},{"text":"My order just arrived and I can't believe how beautiful it is!!! Thank You so much for your beautiful work. I will recommend this company to everyone I know. Again it is beautiful ❤️ \n\n Sincerely \n\nJohn Carter","sentiment":1},{"text":"I LOVE my order! It is perfect. My parents had Ashley for 15 years and she passed in October 2020. What a wonderful keepsake for them! This is their Christmas gift this year. \n  Thank you.  \n  Lisa Shaffer","sentiment":1},{"text":"Hi Brooke, \n  I absolutely love it. It’s for my best friends 60th birthday. I will giving you her on September 14. I want to take a photo with the cube and then submit review. Hope you don’t mind. She’s gonna love it as much as I do.   \n  Stay well.  \n  Dorothy  \n  \n\n Sent from my iPhone","sentiment":1},{"text":"My order arrived and IT IS PERFECT and STUNNING! The item is a gift for a friend whose beloved heart-dog suddenly passed away. I will use your company again and again. Thank you also for the rush shipping. \n\n In gratitude, \n\n Dylan Cooper\n\nmhansen@yahoo.com \n\n Sent from my iPad","sentiment":1},{"text":"Hello,\n \n\n \n I just received my orders today, Although I am happy with my item’s I am not satisfied with the black base or round base they are notthe quality I was expecting\n them to be one of the base looks like a used product witch is why I am asking to be refunded for the total amount of both base. Please contact me back about this matter.","sentiment":0},{"text":"Hi Alejandra Received our Ryan item and it is wonderful  Thank you so very much\n\n Sent from my iPhone","sentiment":1},{"text":"I just received my item today.. love the concept but I didn’t realize the small was so small.. you can barely see the picture of the person. Love the concept but it is entirely to small to be happy with the purchase. Is there any way I can return this and pay the difference on a medium sized item. If not I am not happy with purchase and would like my money back. I ordered through Amazon. Thank you","sentiment":0},{"text":"The quality of the work was amazing and the recipient was emotionally overwhelmed with joy!   \n\n Sent from my iPhone","sentiment":1},{"text":"Hi Susan, I received my Your Company about a week ago. It was going to be a gift for my best friend whose dog passed. I was excited to open it, and then immediately disappointed. The front part of the pit bull looks great. The back looks awful. What was suppose to be the back legs, looks like two testicles. I showed it to my neighbor who is an artist, and she said what nice artwork and the male pit bull looks great. Problem is, Tiffany was a female. I then showed it to people who knew Tiffany and they all asked if I knew Tiffany was a female or why did I make Tiffany a male, as if I was trying to be funny. I am\n\nnot comfortable giving this to my best friend. I already e-mailed this address last Wednesday and did not hear back from your company. Please help rectify this problem. Thank you. Danielle Novak hunterrobertson@gmail.com \n\n Sent from my iPhone","sentiment":0},{"text":"Adam, \n\n The towers we gave at Christmas gifts or warmly and passionately received. They loved them as my wife did hers. We wrote a wonderful review but we have not seen it on your website. We would be most happy to do it again if you would send us a link or instructions. Thank you again! \n\n Brendan \n\n Sent from my iPhone\n\nBrendan Lillard \n\n Arthur J. Gallagher & Co.\n\n12 E Central | Port Jefferybury, LA 74354\n\nMobile: 992-584-3185\n\nalexandria17@yahoo.com\n\njames81@yahoo.com\n\n \n\nThe intent of this analysis is to provide you with general information regarding the status of, and\/or potential concerns related to, your current employee benefits issue. It does not necessarily fully address all your specific issues. It should not be construed as, nor is it intended to provide, legal advice. Questions regarding specific issues should be addressed by the client's general counsel or an attorney who specializes in this practice area. \n\n \n\nThis e-mail and any files transmitted with it are intended only for the person or entity to which it is addressed and may contain confidential material and\/or material protected by law. Any retransmission or use of this information may be a violation of that law. If you received this in error, please contact the sender and delete the material from any computer.\n\n  \n\n >","sentiment":1},{"text":"Good afternoon,  I recieved our order but I am highly disappointed because it is so plain. In the order I asked that the bush or a heart be captured and it was not. :(","sentiment":0},{"text":"To whom it may concern,\n \n  Unfortunately, I did receive the package in its entirety- included was only with only the led wood light stand included. The item itself was not- which is beyond bizarre. I needed this very special yet highly emotional time by a specific timeframe and at this point, that has passed. With that being said, I am extremely disappointed and request a refund for my order please. \n\n\n-- \n Lori Adams, MPA","sentiment":0},{"text":"Hello Itemclearmemories Support, \n\n Thanks for creating a memorable Christmas gift.  I am very pleased with the finished product. \n\n Is it possible to send to me a photo of the item with the photo? \n\n Again many thanks, \n\n Kimberly","sentiment":1},{"text":"Yes, my order arrived and my wife absolutely loved it! I must say that I am however very disappointed that the light only worked for three days. With the amount of money that was spent for the extras, you’d think they would last more than a few days.  I will be leaving a very positive review on the item but my review on the light, I will not recommend.  \n  Thank you.\n\n Sent from my iPhone","sentiment":0},{"text":"Received the item yesterday. Very pleased and happy with the item and excellent customer service.\n\nThank you. \n\n Amanda Davis \n\n ________________________________","sentiment":1},{"text":"I was very disappointed that my whole picture was not in the item!! It pictured us a Bradley’s palaces with Kayla monument behind us!! It was are wedding day!! Sad","sentiment":0},{"text":"\n Message \n We have ordered a your company item and the order number is 537611497264. The quality and the picture in the item is not clear, good and we are not satisfied.\nPlease do needful!","sentiment":0},{"text":"Order arrived on time. However no one really addressed my request that I had when I placed the order. Like no communication whatsoever on it.\nKind of disappointed about that.","sentiment":0},{"text":"I did receive it and it looks great! Thank you very much Joseph but special thanks to Andrea for putting up with me , for her patience and understanding. Tremendous Customer Service!!! Sincerely,    James Arias\n\n Sent from my iPhone","sentiment":1},{"text":"I am so disappointed you sent the correct photo with the wrong names. \nOn 11\/12\/22 I ordered two different pictures two different names. \nI received two of the same picture. \nThen I contacted Melvin Newman , he offered to replace it I sent the corrected picture with the correct name. \nI opened the box it’s the correct picture but the wrong names. \nPlease can you fix this mistake.","sentiment":0},{"text":"I'm really disappointed with this order. My face (bottom left) is bulged","sentiment":0},{"text":"Hi there! I just wanted to say I reserved my item picture today and I absolutely love it! It’s for my fiancé for her graduation gift this Sunday and I know she’s gonna flip out. Thank you so much for the amazing work I’ll definitely recommend you to everyone!  \n\n Mary","sentiment":1},{"text":"\n Message \n Received my photo tower today and my husband looks like he has a beard and he doesn’t not happy with the outcome of the photo very disappointed","sentiment":0},{"text":"Just got an email saying dominions on a small item is 1.97 x 1.97x3 and I payed 79 bucks for ..how do I return item if its been shipped b4 I got email..not happy with size at all!","sentiment":0},{"text":"Received my order today, there is a dark smear on the nose, which is not in the picture I sent or previewed. I’m disappointed in the product that I paid 99.00 😖 \n\n Kristina Combs\n\nCredit Manager\n\nNuWorld Beauty\n\n300 Milik Street\n\nWest Randyview, SD 07008","sentiment":0},{"text":"just received my order. just want to say amazing......... This product is so beautiful my wife loves it thank you so much an i have no problem writing a review for you thanks again for amazing work","sentiment":1},{"text":"Very happy with the glass item I got. Will buy from you again.  \n  \n   Sent from my Verizon, Samsung Galaxy smartphone","sentiment":1},{"text":"Hello, I received my order in good condition but I'm really disappointed with the product, first\n of all I can hardly see the image it's very small not anything like the one on your website. When I went to the mall today and saw what I was hoping to get and what a big difference with the one that was in the mall and the one I ordered from you. I should\n have gone to the mall first before I ordered from you. Sorry but i'm not happy with this item that I'm giving to my niece for a gift I'm embarrassed to give it to her. Thank you","sentiment":0},{"text":"Yes arrived nice safe and sound ❤️\n\n Sent from my iPhone","sentiment":1},{"text":"I just opened the medium heart I ordered\nOrder # (673)305-513556\nI had requested the date to be small print and it bolds out, it’s too large \nI’m not happy with my purchase.\nMr. Austin Ellis \n8335955989\nryan64@hotmail.com","sentiment":0},{"text":"It is beautiful. I will definitely be ordering again and sending business your way.  \n\n Sent from my iPhone","sentiment":1},{"text":"The subjects are difficult to see. Not the clarity of the images in the photos used in your ads. I am disappointedin the product.  \n  Mr. Guy Wright;","sentiment":0},{"text":"Afternoon Mr. Melinda,\n \n\n \n\n First, let me say I Love the item towers. I have given several as gifts as well as have my own. The first gift led to an order with more to come. I am thinking another 20 towers will be ordered. I was wondering if you have any group discount purchasing options. \n\n \n\n \n\n Thank you for your time, \n\n Teresa Floyd;\n\n\n\n\n\n\n -----Original Message-----","sentiment":1},{"text":"Good afternoon, \n\n I just wanted to inform you I love my Your Company image. Shipping was faster then I expected and well packaged. I made this purchase for the family of a coworker I recently lost to Covid19 , when I presented it to them the daughter cried. This let me know I made the right choice when purchasing this item. This item meant a lot to me, my department and the family. \n\n Thank you  \n\n Thank you for your response.","sentiment":1},{"text":"My daughter in law really loves her birthday present item. And it was easy to order and send to her. She received it in a couple of days - I have ordered a item for myself!  \n\n Sent from my iPhone","sentiment":1},{"text":"How nice of you to provide old fashion customer service. Thank you for that. Our item came as promised & in good shape, you were on time. UPS wanted\n to delay delivery but when explained the purpose of the delivery, they delivered it on time. \n  \n Thanks for the follow up. Your company is great & I will continue to recommend you. \n  \n \n Ashley Dennis \n (558)775-4576 \n  \n You can never have too much happy! \n \n ","sentiment":1},{"text":"Just a fabulous piece! Already left a review. Husband loved it!  John Mosley    Sent from Mail for Windows 10  ","sentiment":1},{"text":"I'm very happy with the item memory that I had them make.\nQuality and craftsmanship is top notch. 👍\nService was excellent. 👍\nI have told several friends and family about Your Company Memories.  \nI will be doing business with them again.\n\nThank you so much Brian Wheeler","sentiment":1},{"text":"This. Item made my fiancé look like shit! I just opened it it was supposed to be for her BDay but i cant give it to her.. I was super excited about this.. Now im very disappointed can i send this thing back for a refund or what are my options?","sentiment":0},{"text":"Hi, \n  So sorry I didn't respond sooner. It is just beautiful! It arrived in a timely manner and it will be a Christmaspresent for my friends. I'm sure they will love it as much as I did.  Thank you for being consistent contact. I really appreciate it.  Thanks again for this lovely item.  Cory","sentiment":1},{"text":"Thank you SOOO MUCH for my beautiful order! It was literally perfect!! Breakfast person I gift it to almost cried  \n  ","sentiment":1},{"text":"Hello,  \n  I did receive them and they are absolutely beautiful. I did however mess up on ordering 2 of them too small and didn't realize this until I actually took them out of the box and saw how little they were...So that't completely on me...lol I am however most certainly to order a few more this morning and make sure I get the correct size this time!! I will be sending in the few pics I have for them shortly after I get done training a few clients. Maybe you can give me a few good tips on how to order these correctly lol....Aso I will need another RUSH order on them so very excited to get these orders in this morning!!! Thank you so much for all your help...  \n  Jerry Gaines","sentiment":1},{"text":"I just received my item from you guys and it’s not what I ordered at all. I was supposed to get. A small and got a mini and my text is no where on it and it didn’t get no light either. Father’s Day is a day away and I’m really disappointed.","sentiment":0},{"text":"If I’m not satisfied with it,I can return it for a full refund?","sentiment":0},{"text":"Hi, just a note of appreciation..my cousin absolutely LOVES this gift\/item of her recently passed husband from South Amandahaven. She had never seen anything like this, and it was so nice to be able to give her something that brought joy to her during this difficult time! Thanks for the quality\/beauty of the work!\n\nSincerely,Stephen Young \n\n -----Original Message-----","sentiment":1},{"text":"I am not happy with my order the first one I bought was great this one the skinlooks mottled, nose all white fingerprints on forehead etc We bought this to remember my grandson who died September 2022 at seven years old it’ll be in our living room forever and we want it to look really nice\n\n\nSent from the all new AOL app for iOS","sentiment":0},{"text":"Kind of disappointed I thought it would be colored like the picture sent. It's cool looking but I guess you learn by mistakes.\n\n Sent from Yahoo Mail on Android","sentiment":0},{"text":"I was disappointed in the item pictures on both items. Also, I didn't receive the larger platform.\nHow do I return these items?","sentiment":0},{"text":"Hi Kimberly, \n  \n I just picked it up from the front desk today.  \n I was going to send you an email before the day was done, & let you know how Wonderful it looks!! \n  \n We appreciate your time, & energy on this creation. Look forward to doing business with you again. \n  \n We are so happy with how it turned out!! \n  \n Thank you, & your team so much! \n  \n Respectfully, \n Joseph Allen \n  \n  \n \nJoseph Allen\n\nPsychometrist, TMA- Mental Health and Wellness \n \nKaiser Permanente\n\n\nOffice: (763)534-5911 \n  \n  \n \nJoseph Allen\n\nPsychometrist, TMA- Mental Health and Wellness \n \nKaiser Permanente\n\n\nOffice: (763)534-5911 \n  \n \n NOTICE TO RECIPIENT:\nIf you are not the intended recipient of this e-mail, you are prohibited from sharing, copying, or otherwise using or disclosing its contents.\nIf you have received this e-mail in error, please notify the sender immediately by reply e-mail and permanently delete this e-mail and any attachments without reading, forwarding or saving them.\nThank you.","sentiment":1},{"text":"I received my order today and am not satisfied with the quality of the photo. It is grainy and not clear. It is a surprise birthday gift for October 24th, How can we rectify this. I have placed several orders and this is the first disappointment.    Regards,  Kelly Hernandez  900-676-4494    Sent from Mail for Windows 10  ","sentiment":0},{"text":"I really wanted to get in contact with you about my item . I am soooo happy and I love how everything is so detailed. It’s amazing. Thankyou so much !!! I will be ordering more from you soon .","sentiment":1},{"text":"WArry Smith. 1177 Yorktown Dr Bryanstad WA 70461. I need to purchase the light base for my item.   The square one. I’m not satisfied the way it looks. My cell number is 7543008268. Or by email.  \n\n Sent from my iPhone","sentiment":0},{"text":"\n Message \n I received my order# 200-754-449967 and have to say I am very disappointed that the side of my head is chopped off. You had plenty of ways to contact me to let me know that this was going to be the case, where I would have switched to a larger piece or a different style so this was not the case yet you chose not to reach out very poor business practice!","sentiment":0},{"text":"What a fantastic job you guys do just ordered another from you keep up the great work Matthew","sentiment":1},{"text":"Good Morning Vincent: \n My apologizes for not getting back to you sooner. I received the 3 item cubes I ordered for Christmas gifts. I was so excited about them , but was somewhat disappointed when I received them. 1 of the cubes was awesome! Loved it ( my daughter and granddaughter. The cube of my husband and I, gave him dark fuzzy spots on the top of his head, and face. which he actually has a very noticeable receding hair line. and for me the dark shadow is around my mouth and checks real fuzzy. The one with the German Shepard I was really surprised that his tail, foot and toy was cut off. \n \n \n Thank you for reaching out. \n Renee Baker","sentiment":0},{"text":"I just received my item and it is absolutely MF Amazing!!!!!! WOW.    \n\n Sent from my iPhone","sentiment":1},{"text":"Hello,\n \n\n \n This has arrived and it’s beautiful. Will make a great Christmas gift. \n \n\n \n Thanks.\n\n\n\n Sent from my iPhone","sentiment":1},{"text":"I love it.  It is beautiful. \n\n Thank you doing such a good job. \n\n Sincerely \n\n Elizabeth Gonzalez","sentiment":1},{"text":"Thank you it’s beautiful\n I haven’t given it yet but is beautiful \n Thank you \n \n\n \n Allen Daniels;\n\n\n\n Sent from my iPhone","sentiment":1},{"text":"I want to write a review and express my thanks for three beautiful item pieces you made for me. I chose three dimensional pictures for birthday gifts for family members. Each were gift boxed in a beautiful way.  When I lifted each out into the sunshine I almost cried. I couldn't be more pleased. These will be keepsakes for years to come, for sure! The order was placed on line and within 10 days delivered on my doorstep. Many thanks to Your Company. And for future customers, choose a three dimensional photo when there are multiple figures,  to get the best result. The best gift idea ever!","sentiment":1},{"text":"It is beautiful I love it and so would my sister thank you so much","sentiment":1},{"text":"Hi I received the Craig and the name was totally messed up, I was so disappointed 😭. I wrote his name in Arabic, but it appeared very nice before I order. So I made the order, but when I got it the letters were not connected and the name was totally wrong\n .. it’s my dads item 40 days I want it for that 🥲\n My name is Maria my home number is \n 6397898877 \n Plz let me know what you can do the cost is not cheap that’s why I’m not happy about the result. \n Thanks\n\n \n\n \n Sent from my iPhone","sentiment":0},{"text":"In response to your email, today is December 16, 2022 and I have not received my purchase and have not been able to track it in any way. \n\n I’m very disappointed because when I ordered it your response to ordering is that it was be made and shipped within 3 days and as of today it’s been some 9 days and yet it hasn’t arrived.  Please let me know what can be done as this was to be a Kimmas gift. \n\n Serving Kim with you,\n\nYolanda \n\n For we know that all things work to the good for those who love The Lord and are called according to His purpose.  ROMANS 8:28","sentiment":0},{"text":"I received my your company, and my dog has no face and he’s not black. He’s mostly white I mean Kathy I waited and was so excited and I’m so disappointed with this product. I don’t know what went wrong, but it doesn’t have a face.","sentiment":0},{"text":"ordered twice now from here and both orders I am not satisfied. The first the script wasn’t straight and overlapped. This second order now just doesn’t look like the photo uploaded.  \n\n Sent from my iPhone","sentiment":0},{"text":"I just received my order and the only thing I am not happy with is the base. I would like to return it so I can order a different one that has a on and off switch. \n  Please let me know what I need to do.  \n  Thanks  Larry Bray;\n\n Do Justice, Love Mercy, and Walk Humbly with Your God!","sentiment":0},{"text":"I am very disappointed that the item pic I selected was in color but it shows up I. Grey! That’s scary! I was not looking to make a Halloween scare out of the item tower.  And then it was delivered in a black box that looks like a casket, good Lord, what kind of memory is that? Am sorry  the item is beautiful but it did not meet my expectations of creating a lasting memory. What do I do to return it and get a refund?","sentiment":0},{"text":"Hi\nI am a new customer that recently purchased a gift from you for my wife for our 30th wedding anniversary.\nMy order number is 946876961409\nWhen I received your product yesterday I was very disappointed in how this tower item looked.\nI spent over $100.00 for this product hoping that (based on all the positive reviews) this would be a nice gift for my wife.\nMy disappointment\/concern is that you can barely see the picture and our anniversary date inside the item!\nYou can ONLY see these if you put something behind the item that is black which allows the viewer to more easily see the picture and the date.\nI would really appreciate a response\/action on this please as I really want to like this item but in no way am I satisfied right now. I was hoping to leave a positive review on various social media platforms but am not going to do this until resolved.\nPlease contact me either by phone or e mail. Cell is 5429369202  e mail michaelrose@hotmail.com\nPaul Smith","sentiment":0},{"text":"I received my order today and my wife loves this. Thanks again for staying on top of my order.\n\nBrian \n\n ________________________________","sentiment":1},{"text":"Thank you so much for your service has she enjoyed it so much it was more than we expected and if I have any other gifts I want to buy for myself or my family I would definitely recommend you guys you guys are awesome","sentiment":1},{"text":"To Whom It May Concern: \n\n First off I wish to let you know that I received this order today.  The second thing I wish to tell you is: THANK YOU  from the bottom of my soul for getting this project done so quickly and it truly is stunning.  It represents my son’s spirit so well.  I am truly grateful that I saw this when I did, must have been shown this by my son’s spirit.  It is something that will never fade with time, unlike photos and allows me to visualize him when I need to.  Tammy’s death was sudden and devastating for us, but this will help with remembering him. \n\n Again thank you so much for putting so much love and care and attention into this for us. \n\n Sincerely  \n\n Kenneth Waller","sentiment":1},{"text":"Hello I purchased 3 items 2\/21\/2021 and just recently opened them all for birthday gifts. I have minor issues with with two of them. My first issue is that I purchased a heart shape item with a rotating base but when it rotates the item moves on the platform. I was hoping to trade it in for a regular base or get a refund for the base. My second problem is that on another item I purchased there was a date on the picture but it did not show up on the item I want to know if I can send it back to get the picture either redone with the date on it or get the date written on the item.","sentiment":0},{"text":"We received our items today and they are fabulous; thank you. \n\n Sent from my iPad","sentiment":1},{"text":"The base arrived today, as promised. Good product and great service. \n\n Anthony Greer \n\n Now that is world class service. \n\n Carla","sentiment":1},{"text":"HOW DO I LEAVE FEED BACK, RECEIVED A BEAUTIFUL PIECE","sentiment":1},{"text":"Hey I’m finally home and able to check out the gift and I’m a little disappointed in the writing and numbering that’s on there. I don’t understand why wasn’t the date present in regular numbers? And why was they writing so difficult to read? There should’ve been a demo on that so we could pick something else ! You can’t even read what it says and I’m highly disappointed in that ! The items fine it’s not what I expected but it’ll work, but the writing is very difficult for me to like! Hopefully they’ll see the effort in the gift but I am saddened by the writing!\n\n\nBrian Thomas C:(951)526-3972","sentiment":0},{"text":"Just received it about 4:30 today i really love it , can't wait to give it to my wife , on oir 29th wedding anniversary monday thanks\n\n Sent from Yahoo Mail on Android","sentiment":1},{"text":"Appreciate your response. But because the product output has disappointed the surprise I planned for my wife’s birthday. I don’t want to be responsible for the shipping label. Please send me a return label which doesn’t come at my expense and hope you understand. \n  Thanks,  Alfred Russell.","sentiment":0},{"text":"Greetings! \n\n I am emailing to tell you how satisfied we are with the order! Everyone who’s seen it was amazed and really loved it!\n\nWe have not presented it yet, but we are positive that our Chief will love it! \n\nThank you for everything being perfect with the gift. \n\n Sincerely, \n\n Alexis Lee","sentiment":1},{"text":"\n Message \n I’m very disappointed of what I received, the picture did not look like the picture I wanted , the glass on the corner was chipped & I am ver very upset!","sentiment":0},{"text":"To whom it may concern,    After reviewing you website and looking at the beautiful examples of your your company blocks I ordered one for a Valentines gift. The block i received does not come close to what you show on your website. The picture is very hard to see clearly and it is much smaller than the block. So disappointed.  \n  Sincerely,  David Kelly","sentiment":0},{"text":"Good Morning, \n  My order arrived yesterday and it was a gift. All were very pleased with the product. In fact, we can not figure out how it was constructed. Are you able to share that process with us? Amazing.\n               \n  \n  \n  _____________________________________________  Sarah Martinez \n 221 Harborside Drive, Suite 501\nClaudiaborough, 986 Norris Village Suite 288\nMatthewtown, SD 91452; 12608-882-9055\nCell: 4482046830","sentiment":1},{"text":"IMG_2409.PNG \n\n IMG_2410.jpg\n\nI received my brick item and although I think it’s incredible technology I’m disappointed with the quality of the piece. As you can see the preview and what I actually got. Bryan turned out perfectly but Nicole’s nose got cut off. What a shame, it was going to be a wedding gift, now it’s an expensive paper weight. I can only hope that my experience is a rare occurrence. Better luck next time. Sincerely frank31@hotmail.com\n\nSent from my iPhone","sentiment":0},{"text":"Lisa, \nLooks great! Please call me at your earliest convenience concerning ordering several of this item perfection.  (#(929)871-008842) \nWhat a great way for each family to own one to remember this special, happy woman--wife, mother, and  sister we lost in March.\nBenjamin","sentiment":1},{"text":"I'm very disappointed in the size and of the heart for the price and the font of the writing that you can hardly see. I am gifting this to the First Lady of our church. And the event is on Saturday Jan 7th. Can someone call me ASAP.","sentiment":0},{"text":"I just want to say a big thanks to all the people who helped make my item my grandma passed away last year in September and I bought the item for my mom it’s beautiful I will definitely be ordering again soon","sentiment":1},{"text":"\n Message \n Hello, I love your product. I ordered one for my husband 2 years ago and everyone loves it!!  Just 2 weeks ago I ordered one for my son as an engagement present, and I was a little disappointed in the quality.  He looks ghostly in his item, whereas my husband and I look very 3 dimensional in our item.  Would you take a look at it and see if it is the highest quality you normally produce?\nThank you! I can send you a picture of my earlier item if that would  help.","sentiment":0},{"text":"Hi,  \n  Yes, I have received my order. It is a Christmas gift so it has not been opened by the person it was made for. I checked it and think it’s great!  Thank you!  Jared Poole;","sentiment":1},{"text":"Ann Thank you. I love my product. There is a blemish on it where it looks like a piece of tape that illuminates when put on the base. Its noticable but it may be because of how the cats whiskers had to be done. Wasn't expecting that in such a fine product and at what I paid but it's no big deal I suppose. Just looks odd. Very happy otherwise.  \n  Thomas","sentiment":1},{"text":"Hello Mr. Rachel, \n\n I am sending this email in reference to order #660402923168. This order was a special gift for my loving Aunt. Although my aunt LOVED her item, I was very disappointed to learn the image of my late grandmother (aunt's sister) was omitted from the item. During the order process, I requested three individual's images (see attached) to be included in the item. Unfortunately, there are only two images. Please let me know how this matter can be rectified. Thank you for your time! \n\n Regretfully,\n\nRyan Lopez\n\n78759486867_054246-1.jpg","sentiment":0},{"text":"It was horrible   Was not happy at all with the product.   It was not as advertised.  In addition I should not have to pay for return shipping as it was your company’s  error  I would like the shipping  charges credited back to my charge card.","sentiment":0},{"text":"James, \n\n\n\n I was disappointed to see that the message was not included on the piece. Since it was wrapped so beautifully, I didn't open it until our anniversary. Picture attached. Can you send a corrected piece? \n\n\n\n Thanks, \n\n\n\n Sonia Burke\n\n \n\n\n\n  \n\n \n\n\n\n  \n\n \n\n\n\n  \n\n \n\n\n\n \n -----Original Message-----","sentiment":0},{"text":"I have received the item purchased and I am a somewhat disappointed with the outcome. It was my last ditch effort to keep a memory of us, as he passed away on Feb 25, and was never able to see it. It’s just not clear to see it’s us. Perhaps him a bit more than me.  That’s what I have to say.\n\n Daniel Baker DDS;","sentiment":0},{"text":"Sir, \n\n I received my order and it looks wonderful. Outstanding job, but there \n\nis one issue. The Additional text. It was to read: \n\n Presented to: \n\n Jennifer Mejia 1LT, USAF \n\n C2ISR \n\n But it was engraved as \n\n Presented to: \n\n Jennifer Mejia \n\n 1LT, USAF C2ISR \n\n The rearranging changes the meaning of the presentation piece. Is it \n\npossible to get this Item reworked or produce a new one that says: \n\n Presented to: \n\n Matthew Stephens 1LT, USAF \n\n C2ISR \n\n She is Martin but goes by Ray. I will be happy to send back the \n\noriginal piece. The Graphic came out Amazing! \n\n Thanks, \n\n Craig Drake","sentiment":1},{"text":"Hello,  \n  My name is Lindsay Merritt and I just recently received the order (#288389568312) I placedwith Your Company Memories. The quality of the item is beautiful, yet I am not satisfied with the size of my keepsake. It appeared larger when ordering. Therefore, I am requesting a larger size to replace what I received because I am dissatisfied with the size that was sent to me. Lookingforward to your response and continued business with the company  \n  Sincerely,    Lindsay Merritt  First time Customer","sentiment":0},{"text":"I just wanted to say thank you so much again. My boyfriends grandmother loved it! She cried tears of joy. I am just so happy of the outcome. I will definitely be ordering again! 🥺❤️ THANK YOU!!","sentiment":1},{"text":"Hello. I want to let you know my friend and her son absolutely loved the item I ordered for them. Thank you for your beautiful work. Eventually I want to have one done of my mom. She is 96. She is on home hospiceno. So sad😢.  \n  Sincerely  Melissa Rojas; -- \n Sent from Gmail Mobile","sentiment":1},{"text":"I received it. Simply AMAZING!!!!!!!!! \n ","sentiment":1},{"text":"Bradley, \n\n That’s awesome, thank you SO much!! I apologize for the misunderstanding, it must have gone into my junk folder as you said!  \n\n Thank you,\n\nMatthew  \n\n >","sentiment":1},{"text":"We received the replacement and it is in great condition (undamaged). Thanks for the great support.","sentiment":1},{"text":"Hi, I was trying to find a way to leave a review but couldn’t find a button on your website. I just wanted to personally thank you sooo much!!! I received it today and it is perfect! I can’t wait for my mom to see it on Sunday,\n I know she’s going to love it as much as I do! Worth every penny!!! Just thank you thank you thank you!!!! - Mr. Brad Smith DVM \n \n \n\n \n Get Outlook for iOS","sentiment":1},{"text":"Thank you I loved it my one concern was my message for my gift was attached to the shipping info and I wished it to be in a separated paper but overall amazing job ty!!","sentiment":1},{"text":"I received my order today. Its so much more than I expected! This will be a perfect gift for my mom","sentiment":1},{"text":"To ALL this may concern, I am one SATISFIED customer! I placed this order on June 8th and just received it today, June 11th.  The quality, the elegance.....I'm almost speechless.  It's absolutely beautiful! My husband just lost his father 3 weeks ago and I thought for Fathers day, this would be a nice gift.  His going to love it as much as I do.  Thank you, Thank you!!","sentiment":1},{"text":"Hello, \n\n I just received my order and I am really disappointed. My order number is 663-277-603069. It definitely doesn’t look as bright and defined as the description promised. I can hardly see the picture and it’s only barely visible when it’s on the stand with the light. The stand itself is poorly made and has couple of scratches and when rotates it’s crooked. Very upset with my order, it was supposed to have been an anniversary present. \n\n Jason Taylor  \n\n .","sentiment":0},{"text":"Good afternoon, \n  I just received the order and I'm not satisfied with the photo. It was my understanding that only the photo of the dog would be engraved and all other background would be removed. The item block I received has the photo of the dog and a human foot.  \n  Please advise how to get thiscorrected?  \n  Thank you,  \n  Heather Davis;","sentiment":0},{"text":"Thank you, Danielle! It is absolutely stunning! My nephew died tragically in a motorcycle accident. He would have just turned 21. My family is beyond broken. I saw your ad and thought what a beautiful memory to have. And while I haven't decided whom to give it to yet, I am certain that you will see this order come through again in the near future. I will definitely look forward to receiving a review from your company. \n  Thanks so much!!  Kathryn Dunn","sentiment":1},{"text":"I absolutely LOVE my products! They turned out beauitful! Thank u for an awesome product a short amount of time!  \n\n Sent from my iPhone","sentiment":1},{"text":"Im am beyond devastated ups tracking said they delivered package at front door of apartment at 1240 and it isn t there this was very expensive and dear to my heart what do I need to do","sentiment":0},{"text":"Everything is good  \n  Beautiful piece great job, my girlfriend was blown away Thank you","sentiment":1},{"text":"I just want to say.I love my order.Thanks for the great service.","sentiment":1},{"text":"Dear Alexandra, Thank for your quick and warm response, my 3D laser image item brick was delivered yesterday, before scheduled, the brick image is absolutely breath taking. Thank you for all you do, much appreciated, David Kirby; \n\n Sent from Yahoo Mail on Android","sentiment":1},{"text":"The new base works great!! Thank you! My wife loves it!  ","sentiment":1},{"text":"what a waste of money.I can\"t even see the picture that was used,  it looks like a plain piece of glass.I am extremely disappointed with this and would not recommend anybody to you.","sentiment":0},{"text":"\n Message \n I received my order on today but am not satisfied with the photo. It appears blurry and not clear. Please advise how I need to proceed. Order #(567)425-206830.","sentiment":0},{"text":"I was absolutely blown away with  the quality, price and delivery.  I have been wanting another dog since my \"Sunny\" crossed the Rainbow Bridge.  I have been stopped, for now with the virus situation.  I have my dog, so to speak, back in this fantastic 3D item image.  It brought tears to my eyes.\nPs. Can I use the 10% referral card discount on MY next purchase.\nThank You So Much\nGod bless. Stay well\nMartin Rice","sentiment":1},{"text":"I received my purchase today and opened the boxes to see the product before I wrap them to give as a gift to my wife. I am extremely disappointed in the LED base that I purchased. I ordered the XXL item and the base is absolutely  too small. The item hangs off both sides of the base when centered. None of your examples that I saw showed a item larger than the base. In fact the XXL item on your page fit nicely on a base larger than the item. Did I receive the wrong base?","sentiment":0},{"text":"I received the base today. It fits perfect and my item is beautiful. Thankyou so much for your help. My dad said he left a good review. \n   -------- Original message --------","sentiment":1},{"text":"I wrote a review and tried to submit it but it wouldn't let me. This is what I wrote: \n \n\n\n \n \nI absolutely LOVE these your company heart memories I ordered. I have ordered 5 of them now and plan to order more as needed. Every person I have given them to has loved them. They are literally your company and don't loose their look at all. I would HIGHLY\n recommend these to whoever wants a really cool and really neat and unusual gift to give someone!!\n\n \n \n\n\n \n \nI gave it the highest rating and titled it \"Your Company Choice\"  \n \n\n\n \n \nMaybe you can figure out how to get it to post.","sentiment":1},{"text":"Good afternoon \n\n Thank you for the order. I was very surprised that you were able to get it to me early (arrived yesterday). The kids and I gave it to my wife today and she absolutely loved it! The detail in the picture is truly exceptional, and your quick responses to my questions shows your excellent customer service. I would definitely recommend your company to anyone looking a special gift. Thanks again and have a great day!! \n\n Gerald Clark \n\n Sent from my iPhone \n\n >","sentiment":1},{"text":"I already emailed someone about my purchase, I was not happy with it, it did not look 2d, it looked like a miniature connect the dots picture. Someone responded that they would, “clean it up,” and re-do it,” that was the last I heard of it.\n\nDavid\n\nSent from my iPad","sentiment":0},{"text":"It just arrived sorry for the mistake Thank you I love it to much","sentiment":1},{"text":"Great work folks. Im blown away!!!!  \n  \n  Merry Christmas","sentiment":1},{"text":"Hi there! \n \nI just wanted to let you know that that was an exquisite piece of work! I look forward to placing a review for you when the review link arrives. Everyone who has seen that work of art has had nothing but praise for it. Thank youso much and sorry for the late\n notice. I have bookmarked your site and will be using your services again in the future. Thanksso much! \n \n\n\n \n \nRegards, \n \n\n\n \n \nGary Kemp","sentiment":1},{"text":"Hi Martha,\n\nJust wanted to pop in and thank you for the amazing work. My mom absolutely loved her gift - we lost my grandma a month ago who was the matriarch of our family, and my mom is undergoing chemo for breast cancer so it is a hard time for our family. But since I gave my mom the gift this morning, she has not put it down and can’t stop talking about it. Thank you so much for making my moms Mothers Day! Wishing a Happy Mother’s Day to you all. \n\n William Obrien﻿","sentiment":1},{"text":"We received our order on 11\/11 and the Item was beautiful.  We were however disappointed with the light base as it does not offer a battery option and must be plugged in limiting the locations it can be placed.  I did not notice in the description on the website what the power source was.  I will need to purchase a 3rd party base to be able to place in appropriate location. \n\n Respectfully \n\n Michael Chase","sentiment":0},{"text":"I also just noticed my moms eyes are not looking forward like in picture. Now I’m definitely not satisfied with your work \n\n Sent from my iPhone","sentiment":0},{"text":"Thank you, this is beautiful and they loved it.","sentiment":1},{"text":"Thanks so much. They lookgreat!","sentiment":1},{"text":"Emily, \n  THANK YOU so much for the new “brick” item of Jessica. It’s perfect! I know my friend will love it. I really do appreciate all your help.  \n  Courtney\n\n Sent from my iPad","sentiment":1},{"text":"Jacqueline,  \n  I just received the replacement base and it works perfectly; I don't have to jimmy with the on\/off button at all! Thank you SO MUCH for yourfantastic customer service. My priceless keepsake is all aglow!  \n  Warmest regards,  Jim Pierce;\n\n\n-----Original Message-----","sentiment":1},{"text":"Order #(857)982-509708\nI just received my order!  They are fantastic - even better than I expected.   I ordered 3 different items but only received 1 cleaning cloth.  Can you send me 2 more?  Thank you.  James Young","sentiment":1}]